# Wrangling Countries & UN Regions
## By: Scott Kustes

### Objective:
Wrangle UN regions and subregions and associated countries for insertion into website database.

#### Dataset:
The original dataset was downloaded here: https://unstats.un.org/unsd/methodology/m49/

#### Contents
- <a href='#gather'>Data Gathering</a>
- <a href='#assess1'>Assess, Part 1</a>
- <a href='#clean1'>Clean, Part 1</a>
- <a href='#assess2'>Assess, Part 2</a>
- <a href='#clean2'>Clean, Part 2</a>
- <a href='#extract-un'>UN Regional Hierarchy Extraction</a>
- <a href='#assess3'>Assess, Part 3</a>
- <a href='#clean3'>Clean, Part 3</a>
- <a href='#extract-groups'>UN Groupings Extraction</a>
- <a href='#assess4'>Assess, Part 4</a>
- <a href='#clean4'>Clean, Part 4</a>

In [67]:
# Import necessary packages
import pandas as pd

<a id='gather'></a>
## Gather

In [68]:
countries = pd.read_csv( 'countries.csv' )
countries.head()

,Global Code,Global Name,Region Code,Region Name,Sub-region Code,Sub-region Name,Intermediate Region Code,Intermediate Region Name,Common Name,Official Name,Capital,Territory of,M49 Code,ISO-alpha3 Code,Least Developed Countries (LDC),Land Locked Developing Countries (LLDC),Small Island Developing States (SIDS),Developed / Developing Countries
0,1,World,2.0,Africa,202.0,Sub-Saharan Africa,11.0,Western Africa,"""Saint Helena, Ascension, and Tristan da Cunha""","""Saint Helena, Ascension, and Tristan da Cunha""",Jamestown,United Kingdom,654,SHN,NaN,NaN,NaN,Developing
1,1,World,142.0,Asia,34.0,Southern Asia,NaN,NaN,Afghanistan,Islamic Republic of Afghanistan,Kabul,NaN,4,AFG,x,x,NaN,Developing
2,1,World,150.0,Europe,154.0,Northern Europe,NaN,NaN,Åland Islands,Åland Islands,Mariehamn,Finland,248,ALA,NaN,NaN,NaN,Developed
3,1,World,150.0,Europe,39.0,Southern Europe,NaN,NaN,Albania,Republic of Albania,Tirana,NaN,8,ALB,NaN,NaN,NaN,Developed
4,1,World,2.0,Africa,15.0,Northern Africa,NaN,NaN,Algeria,People's Democratic Republic of Algeria,Algiers,NaN,12,DZA,NaN,NaN,NaN,Developing

<a id='assess1'></a>
## Assess, Part 1

In [69]:
countries['Global Code'].unique()

array([1], dtype=int64)

In [70]:
countries['Global Name'].unique()

array(['World'], dtype=object)

### Issues Found:
1) Drop columns: `Global Code` and `Global Name` - only 1 unique value

2) Rename columns: replace spaces with underscores, replace uppercase with lowercase

<a id='clean1'></a>
## Clean, Part 1
### 1) Drop columns `Global Code` and `Global Name`

Drop `Global Code` and `Global Name` columns due to each having only 1 unique value (1 and World, respectively).

#### Code

In [71]:
countries.drop( columns=['Global Code','Global Name'], axis=1, inplace=True )

#### Test

In [72]:
countries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 249 entries, 0 to 248
Data columns (total 16 columns):
Region Code                                248 non-null float64
Region Name                                248 non-null object
Sub-region Code                            248 non-null float64
Sub-region Name                            248 non-null object
Intermediate Region Code                   108 non-null float64
Intermediate Region Name                   108 non-null object
Common Name                                249 non-null object
Official Name                              249 non-null object
Capital                                    243 non-null object
Territory of                               48 non-null object
M49 Code                                   249 non-null int64
ISO-alpha3 Code                            248 non-null object
Least Developed Countries (LDC)            47 non-null object
Land Locked Developing Countries (LLDC)    32 non-null object
Small Island Developing States (SIDS)      53 non-null object
Developed / Developing Countries           248 non-null object
dtypes: float64(3), int64(1), object(12)
memory usage: 31.2+ KB

### 2) Rename Columns
Replace spaces with underscores, replace uppercase letters with lowercase

#### Code

In [73]:
# Dictionary of new column names
column_names = {
    'Region Code': 'region_code',
    'Region Name': 'region_name',
    'Sub-region Code': 'subregion_code',
    'Sub-region Name': 'subregion_name',
    'Intermediate Region Code': 'intermediate_region_code',
    'Intermediate Region Name': 'intermediate_region_name',
    'Common Name': 'country_common_name',
    'Official Name': 'country_official_name',
    'Capital': 'capital',
    'Territory of': 'territory_of',
    'M49 Code': 'un_m49',
    'ISO-alpha3 Code': 'iso_alpha3',
    'Least Developed Countries (LDC)': 'least_developed_countries',
    'Land Locked Developing Countries (LLDC)': 'landlocked_developing_countries',
    'Small Island Developing States (SIDS)': 'small_island_developing_states',
    'Developed / Developing Countries': 'developed_developing_countries'
}

countries.rename( mapper=column_names, axis=1, inplace=True )

#### Test

In [74]:
countries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 249 entries, 0 to 248
Data columns (total 16 columns):
region_code                        248 non-null float64
region_name                        248 non-null object
subregion_code                     248 non-null float64
subregion_name                     248 non-null object
intermediate_region_code           108 non-null float64
intermediate_region_name           108 non-null object
country_common_name                249 non-null object
country_official_name              249 non-null object
capital                            243 non-null object
territory_of                       48 non-null object
un_m49                             249 non-null int64
iso_alpha3                         248 non-null object
least_developed_countries          47 non-null object
landlocked_developing_countries    32 non-null object
small_island_developing_states     53 non-null object
developed_developing_countries     248 non-null object
dtypes: float64(3), int64(1), object(12)
memory usage: 31.2+ KB

<a id='assess2'></a>
## Assess, Part 2

In [75]:
countries['region_code'].unique()

array([  2., 142., 150.,   9.,  19.,  nan])

In [76]:
countries['region_name'].unique()

array(['Africa', 'Asia', 'Europe', 'Oceania', 'Americas', nan],
      dtype=object)

In [77]:
countries[ countries['region_code'].isnull() ]

,region_code,region_name,subregion_code,subregion_name,intermediate_region_code,intermediate_region_name,country_common_name,country_official_name,capital,territory_of,un_m49,iso_alpha3,least_developed_countries,landlocked_developing_countries,small_island_developing_states,developed_developing_countries
9,NaN,NaN,NaN,NaN,NaN,NaN,Antarctica,Antarctica,NaN,NaN,10,ATA,NaN,NaN,NaN,NaN

In [78]:
countries['developed_developing_countries'].unique()

array(['Developing', 'Developed', nan], dtype=object)

In [79]:
countries['intermediate_region_name'].unique()

array(['Western Africa', nan, 'Middle Africa', 'Caribbean',
       'South America', 'Central America', 'Southern Africa',
       'Eastern Africa', 'Channel Islands'], dtype=object)

In [80]:
countries['region_name'].unique()

array(['Africa', 'Asia', 'Europe', 'Oceania', 'Americas', nan],
      dtype=object)

In [81]:
countries['subregion_name'].unique()

array(['Sub-Saharan Africa', 'Southern Asia', 'Northern Europe',
       'Southern Europe', 'Northern Africa', 'Polynesia',
       'Latin America and the Caribbean', nan, 'Western Asia',
       'Australia and New Zealand', 'Western Europe', 'Eastern Europe',
       'Northern America', 'South-eastern Asia', 'Eastern Asia',
       'Melanesia', 'Micronesia', 'Central Asia'], dtype=object)

### Issues Found:
1) Replace NaN with 0 in `region_code`, `subregion_code`, and `intermediate_region_code`

2) Replace NaN with 0 and 'x' with 1 in `least_developed_countries`, `landlocked_developing_countries`, and `small_island_developing_states`

3) Set datatypes:
- <strong>int64:</strong> `region_code`, `subregion_code`, `intermediate_region_code`</li>
- <strong>bool:</strong> `least_developed_countries`, `landlocked_developing_countries`, `small_island_developing_states`

<a id='clean2'></a>
## Clean, Part 2
### 1) Fix Values in Columns with Region Codes
Replace NaN with 0 in region_code, subregion_code, and intermediate_region_code

#### Code

In [82]:
countries['region_code'].fillna( 0, inplace=True )
countries['subregion_code'].fillna( 0, inplace=True )
countries['intermediate_region_code'].fillna( 0, inplace=True )

#### Test

In [83]:
countries['region_code'].unique()

array([  2., 142., 150.,   9.,  19.,   0.])

In [84]:
countries['subregion_code'].unique()

array([202.,  34., 154.,  39.,  15.,  61., 419.,   0., 145.,  53., 155.,
       151.,  21.,  35.,  30.,  54.,  57., 143.])

In [85]:
countries['intermediate_region_code'].unique()

array([ 11.,   0.,  17.,  29.,   5.,  13.,  18.,  14., 830.])

### 2) Fix Values in 'Other Groupings'
Replace NaN with 0 and 'x' with 1 in `least_developed_countries`, `landlocked_developing_countries`, and `small_island_developing_states`

#### Code

In [86]:
countries['least_developed_countries'].fillna( 0, inplace=True )
countries['least_developed_countries'].replace( 'x', 1, inplace=True )

countries['landlocked_developing_countries'].fillna( 0, inplace=True )
countries['landlocked_developing_countries'].replace( 'x', 1, inplace=True )

countries['small_island_developing_states'].fillna( 0, inplace=True )
countries['small_island_developing_states'].replace( 'x', 1, inplace=True )

#### Test

In [87]:
countries['least_developed_countries'].unique()

array([0, 1], dtype=int64)

In [88]:
countries['landlocked_developing_countries'].unique()

array([0, 1], dtype=int64)

In [89]:
countries['small_island_developing_states'].unique()

array([0, 1], dtype=int64)

### 3) Set Datatypes
- <strong>int64:</strong> `region_code`, `subregion_code`, `intermediate_region_code`
- <strong>bool:</strong> `least_developed_countries`, `landlocked_developing_countries`, and `small_island_developing_states`

#### Code

In [90]:
# Set int64 columns
countries['region_code'] = countries['region_code'].astype( 'int64' )
countries['subregion_code'] = countries['subregion_code'].astype( 'int64' )
countries['intermediate_region_code'] = countries['intermediate_region_code'].astype( 'int64' )

# Set bool columns
countries['least_developed_countries'] = countries['least_developed_countries'].astype( 'bool' )
countries['landlocked_developing_countries'] = countries['landlocked_developing_countries'].astype( 'bool' )
countries['small_island_developing_states'] = countries['small_island_developing_states'].astype( 'bool' )

#### Test

In [91]:
countries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 249 entries, 0 to 248
Data columns (total 16 columns):
region_code                        249 non-null int64
region_name                        248 non-null object
subregion_code                     249 non-null int64
subregion_name                     248 non-null object
intermediate_region_code           249 non-null int64
intermediate_region_name           108 non-null object
country_common_name                249 non-null object
country_official_name              249 non-null object
capital                            243 non-null object
territory_of                       48 non-null object
un_m49                             249 non-null int64
iso_alpha3                         248 non-null object
least_developed_countries          249 non-null bool
landlocked_developing_countries    249 non-null bool
small_island_developing_states     249 non-null bool
developed_developing_countries     248 non-null object
dtypes: bool(3), int64(4), object(9)
memory usage: 26.1+ KB

<a id='extract-un'></a>
## UN Regional Hierarchy Extraction
Extract UN Regional hierarchy and rationalize for insertion into website database.

### Create UN Region Hierarchy
In the UN Geoscheme, a region is made up of 1 or more subregions and a subregion is made up of 0 or more intermediate regions. Countries/areas are assigned at either the subregional or intermediate regional level (with Antarctica as the sole exception, having no regional assignment). Note that the hierarchy levels are as follows: `Region -> Subregion -> Intermediate Region`

Antarctica is assigned to `region_code` 0

The `countries` dataframe contains redundant information across the region, subregion, and intermediate region columns. Extract these values to create a hierarchy of UN regions in a new dataframe called `regions`. This new dataframe will contain 3 columns: 
- `region_code`: the value from the `region_code`, `subregion_code`, or `intermediate_region_code` column
- `region_name`: the value from the `region_name`, `subregion_name`, or `intermediate_region_name` column
- `parent_region_code`: the `region_code` for the region or subregion one level above in the hierarchy

In the `countries` dataframe, create a new column called `un_region` to hold the subregion or intermediate region to which each country is assigned.

#### Code

In [92]:
# Create an empty dataframe for holding the regions
regions = pd.DataFrame( columns=['region_code','region_name','parent_region_code'] )

# Iterrate through the countries to extract the UN region information
for row in countries.itertuples():
    # Get the region information from this row
    region_code = row.region_code
    region_name = row.region_name if region_code != 0 else 'Antarctica' # Antarctica is the sole exception so make it a top-level region
    subregion_code = row.subregion_code
    subregion_name = row.subregion_name
    intermediate_region_code = row.intermediate_region_code
    intermediate_region_name = row.intermediate_region_name
    
    # If region doesn't exist in regions dataframe already, add it
    if region_code not in regions['region_code'].unique():
        regions = regions.append( { 'region_code': region_code, 
                                    'region_name': region_name, 
                                    'parent_region_code': 0 }, 
                                    ignore_index=True )
    
    # If subregion doesn't exist in regions dataframe already, add it
    if ( subregion_code != 0 ) & ( subregion_code not in regions['region_code'].unique() ):
        regions = regions.append( { 'region_code': subregion_code, 
                                    'region_name': subregion_name, 
                                    'parent_region_code': region_code }, 
                                    ignore_index=True )

    # If intermediate region doesn't exist in regions dataframe already, add it
    if ( intermediate_region_code != 0 ) & ( intermediate_region_code not in regions['region_code'].unique() ):
        regions = regions.append( { 'region_code': intermediate_region_code, 
                                    'region_name': intermediate_region_name, 
                                    'parent_region_code': subregion_code }, 
                                    ignore_index=True )

In [93]:
# Function to populate un_region field in countries dataframe
# If intermediate_region_code is not 0, return the intermediate_region_code
# Else return subregion_code 
# Note that one entry contains 0 in subregion_code: Antarctica
# Antarctica was previously assigned a region_code of 0 so returning subregion_code of 0 will not cause problems
def get_un_region( row ):
    # If intermediate_region_code is not 0, return it
    if row['intermediate_region_code'] != 0:
        return row['intermediate_region_code']
    else:
        return row['subregion_code']

countries['un_region'] = countries.apply( get_un_region, axis=1 )

#### Test

In [94]:
regions.sort_values( 'parent_region_code' )

   region_code                      region_name parent_region_code
0            2                           Africa                  0
12          19                         Americas                  0
9            9                          Oceania                  0
5          150                           Europe                  0
15           0                       Antarctica                  0
3          142                             Asia                  0
8           15                  Northern Africa                  2
1          202               Sub-Saharan Africa                  2
28          57                       Micronesia                  9
27          54                        Melanesia                  9
10          61                        Polynesia                  9
18          53        Australia and New Zealand                  9
13         419  Latin America and the Caribbean                 19
22          21                 Northern America                 19
26          30                     Eastern Asia                142
25          35               South-eastern Asia                142
4           34                    Southern Asia                142
17         145                     Western Asia                142
30         143                     Central Asia                142
19         155                   Western Europe                150
20         151                   Eastern Europe                150
7           39                  Southern Europe                150
6          154                  Northern Europe                150
29         830                  Channel Islands                154
23          18                  Southern Africa                202
24          14                   Eastern Africa                202
11          17                    Middle Africa                202
2           11                   Western Africa                202
21          13                  Central America                419
14          29                        Caribbean                419
16           5                    South America                419

In [95]:
countries[['subregion_code','intermediate_region_code','un_region']].sample(10)

     subregion_code  intermediate_region_code  un_region
44              202                        17         17
183             202                        14         14
86               39                         0         39
73              419                         5          5
229             419                        29         29
102             154                         0        154
216             145                         0        145
207              30                         0         30
186             419                        29         29
237             419                         5          5

<a id='assess3'></a>
## Assess, Part 3

In [96]:
countries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 249 entries, 0 to 248
Data columns (total 17 columns):
region_code                        249 non-null int64
region_name                        248 non-null object
subregion_code                     249 non-null int64
subregion_name                     248 non-null object
intermediate_region_code           249 non-null int64
intermediate_region_name           108 non-null object
country_common_name                249 non-null object
country_official_name              249 non-null object
capital                            243 non-null object
territory_of                       48 non-null object
un_m49                             249 non-null int64
iso_alpha3                         248 non-null object
least_developed_countries          249 non-null bool
landlocked_developing_countries    249 non-null bool
small_island_developing_states     249 non-null bool
developed_developing_countries     248 non-null object
un_region                          249 non-null int64
dtypes: bool(3), int64(5), object(9)
memory usage: 28.0+ KB

In [97]:
countries[ countries['iso_alpha3'].isnull() ]

,region_code,region_name,subregion_code,subregion_name,intermediate_region_code,intermediate_region_name,country_common_name,country_official_name,capital,territory_of,un_m49,iso_alpha3,least_developed_countries,landlocked_developing_countries,small_island_developing_states,developed_developing_countries,un_region
193,150,Europe,154,Northern Europe,830,Channel Islands,Sark,Sark,NaN,United Kingdom,680,NaN,False,False,False,Developed,830

In [98]:
countries[ countries['developed_developing_countries'].isnull() ]

,region_code,region_name,subregion_code,subregion_name,intermediate_region_code,intermediate_region_name,country_common_name,country_official_name,capital,territory_of,un_m49,iso_alpha3,least_developed_countries,landlocked_developing_countries,small_island_developing_states,developed_developing_countries,un_region
9,0,NaN,0,NaN,0,NaN,Antarctica,Antarctica,NaN,NaN,10,ATA,False,False,False,NaN,0

### Issues Found:
#### Tidiness
1) Drop 6 UN region columns: `region_code`,`region_name`,`subregion_code`,`subregion_name`,`intermediate_region_code`,`intermediate_region_name`

2) Create two columns, `developed` and `developing`, from `developed_developing_countries` column. 

3) Set datatype of `developed` and `developing` to bool.

4) Drop `developed_developing_countries`.

#### Quality
5) Replace NaN in `iso_alpha3` with 'NA'. The island of Sark has no ISO Alpha3 code.

<a id='clean3'></a>
## Clean, Part 3

### 1) Drop 6 UN region columns
Drop `region_code`,`region_name`,`subregion_code`,`subregion_name`,`intermediate_region_code`, and `intermediate_region_name`. These columns are no longer needed. This information is now contained in the `regions` dataframe to which each country is associated through the `un_region` column.

#### Code

In [99]:
countries.drop( columns=['region_code','region_name','subregion_code','subregion_name','intermediate_region_code','intermediate_region_name'], axis=1, inplace=True )

#### Test

In [100]:
countries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 249 entries, 0 to 248
Data columns (total 11 columns):
country_common_name                249 non-null object
country_official_name              249 non-null object
capital                            243 non-null object
territory_of                       48 non-null object
un_m49                             249 non-null int64
iso_alpha3                         248 non-null object
least_developed_countries          249 non-null bool
landlocked_developing_countries    249 non-null bool
small_island_developing_states     249 non-null bool
developed_developing_countries     248 non-null object
un_region                          249 non-null int64
dtypes: bool(3), int64(2), object(6)
memory usage: 16.4+ KB

### 2) Create `developed` and `developing` Columns

`developed` will contain 1 if `developed_developing_countries` contains 'Developed', 0 otherwise<br/>
`developing` will contain 1 if `developed_developing_countries` contains 'Developing', 0 otherwise

#### Code

In [101]:
countries['developed'] = countries['developed_developing_countries'].apply( lambda x: 1 if x == 'Developed' else 0 )
countries['developing'] = countries['developed_developing_countries'].apply( lambda x: 1 if x == 'Developing' else 0 )

#### Test

In [102]:
countries[['developed','developing','developed_developing_countries']].sample(5)

     developed  developing developed_developing_countries
205          0           1                     Developing
187          0           1                     Developing
17           0           1                     Developing
136          1           0                      Developed
74           1           0                      Developed

### 3) Set datatype for `developed` and `developing` Columns to bool

#### Code

In [103]:
countries['developed'] = countries['developed'].astype('bool')
countries['developing'] = countries['developing'].astype('bool')

#### Test

In [104]:
countries['developed'].value_counts()

False    183
True      66
Name: developed, dtype: int64

In [105]:
countries['developing'].value_counts()

True     182
False     67
Name: developing, dtype: int64

In [106]:
countries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 249 entries, 0 to 248
Data columns (total 13 columns):
country_common_name                249 non-null object
country_official_name              249 non-null object
capital                            243 non-null object
territory_of                       48 non-null object
un_m49                             249 non-null int64
iso_alpha3                         248 non-null object
least_developed_countries          249 non-null bool
landlocked_developing_countries    249 non-null bool
small_island_developing_states     249 non-null bool
developed_developing_countries     248 non-null object
un_region                          249 non-null int64
developed                          249 non-null bool
developing                         249 non-null bool
dtypes: bool(5), int64(2), object(6)
memory usage: 16.9+ KB

### 4) Drop `developed_developing_countries` Column

#### Code

In [107]:
countries.drop( columns=['developed_developing_countries'], inplace=True )

#### Test

In [108]:
countries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 249 entries, 0 to 248
Data columns (total 12 columns):
country_common_name                249 non-null object
country_official_name              249 non-null object
capital                            243 non-null object
territory_of                       48 non-null object
un_m49                             249 non-null int64
iso_alpha3                         248 non-null object
least_developed_countries          249 non-null bool
landlocked_developing_countries    249 non-null bool
small_island_developing_states     249 non-null bool
un_region                          249 non-null int64
developed                          249 non-null bool
developing                         249 non-null bool
dtypes: bool(5), int64(2), object(5)
memory usage: 14.9+ KB

### 5) Replace NaN in `iso_alpha3` with 'NA'

The island of Sark has no ISO Alpha3 code.

#### Code

In [109]:
countries['iso_alpha3'].fillna( 'NA', inplace=True )

#### Test

In [110]:
countries[ countries['iso_alpha3'].isnull() ]

Empty DataFrame
Columns: [country_common_name, country_official_name, capital, territory_of, un_m49, iso_alpha3, least_developed_countries, landlocked_developing_countries, small_island_developing_states, un_region, developed, developing]
Index: []

<a id='extract-groups'></a>
## UN Groupings Extraction
Extract and rationalize information in the five "Other Groupings" columns: `least_developed_countries`, `landlocked_developing_countries`, `small_island_developing_states`, `developed`, and `developing`.  This information will be stored in 2 database tables. 

The first table will contain five grouping titles: 'Least Developed Countries', 'Landlocked Developing Countries', 'Small Island Developing States', 'Developed', and 'Developing'.

The second table will contain mappings of country ID to grouping ID.

#### Code

In [111]:
# Create a dataframe for the Other Groupings
group_names = ['Least Developed Countries', 'Landlocked Developing Countries', 'Small Island Developing States', 'Developed Countries', 'Developing Countries']
un_groupings = pd.DataFrame( data=group_names, columns=['group_name'] )

In [112]:
# Get the indexes for the countries in each grouping
least_developed = countries.query( 'least_developed_countries == True' ).index.to_list()
landlocked = countries.query( 'landlocked_developing_countries == True' ).index.to_list()
small_island = countries.query( 'small_island_developing_states == True' ).index.to_list()
developed = countries.query( 'developed == True' ).index.to_list()
developing = countries.query( 'developing == True' ).index.to_list()

In [113]:
# Create a blank dataframe to contain the country to grouping mappings
country_to_group = pd.DataFrame( columns=['country_id', 'group_id'] )

groups = ['least_developed','landlocked','small_island','developed','developing']
group_id = 0
for variable_name in groups:
    for value in eval( variable_name ):
        country_to_group = country_to_group.append( { 'country_id': value,
                                                      'group_id': group_id },
                                                      ignore_index=True )
    group_id += 1

#### Test

In [114]:
un_groupings

                        group_name
0        Least Developed Countries
1  Landlocked Developing Countries
2   Small Island Developing States
3              Developed Countries
4             Developing Countries

In [115]:
country_to_group.sample(10)

    country_id group_id
354        219        4
70         179        1
174        146        3
293        137        4
170        128        3
295        139        4
262         90        4
50          26        1
378        247        4
40         221        0

In [116]:
# Found this one by luck
country_to_group.query( 'country_id == 230' )

    country_id group_id
42         230        0
129        230        2
365        230        4

In [117]:
# Is True in the correct columns?
countries.query( 'index == 230' )

,country_common_name,country_official_name,capital,territory_of,un_m49,iso_alpha3,least_developed_countries,landlocked_developing_countries,small_island_developing_states,un_region,developed,developing
230,Tuvalu,Ellice Islands,Funafuti,NaN,798,TUV,True,False,True,61,False,True

<a id='assess4'></a>
## Assess, Part 4

In [118]:
countries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 249 entries, 0 to 248
Data columns (total 12 columns):
country_common_name                249 non-null object
country_official_name              249 non-null object
capital                            243 non-null object
territory_of                       48 non-null object
un_m49                             249 non-null int64
iso_alpha3                         249 non-null object
least_developed_countries          249 non-null bool
landlocked_developing_countries    249 non-null bool
small_island_developing_states     249 non-null bool
un_region                          249 non-null int64
developed                          249 non-null bool
developing                         249 non-null bool
dtypes: bool(5), int64(2), object(5)
memory usage: 14.9+ KB

### Issues Found:
#### Quality
1) Remove quotes from Common and Official Names. Several entries contain " in official name (ex: "Bonaire, Sint Eustatius, and Saba") due to commas in field breaking CSV formatting on input. Remove quotes.

2) Change text input in `territory_of` to index of associated country. Ex: where `territory_of` is 'United Kingdom', change to 194.

3) Fill NaN values in `territory_of` with 0. Set datatype of `territory_of` to int.

#### Tidiness
4) Drop 5 UN grouping columns: `least_developed_countries`,`landlocked_developing_countries`,`small_island_developing_states`,`developed`,`developing`

<a id='clean4'></a>
## Clean, Part 4

### 1) Remove quotes from Official Names

Several entries contain " in official name (ex: "Bonaire, Sint Eustatius, and Saba") due to commas in field breaking CSV formatting on input. Remove quotes.

#### Code

In [119]:
countries[ countries['country_official_name'].str.contains('"') ]

,country_common_name,country_official_name,capital,territory_of,un_m49,iso_alpha3,least_developed_countries,landlocked_developing_countries,small_island_developing_states,un_region,developed,developing
0,"""Saint Helena, Ascension, and Tristan da Cunha""","""Saint Helena, Ascension, and Tristan da Cunha""",Jamestown,United Kingdom,654,SHN,False,False,False,11,False,True
25,BES Islands,"""Bonaire, Sint Eustatius, and Saba""",Kralendijk,Netherlands,535,BES,False,False,True,29,False,True

In [121]:
countries.loc[0,'country_official_name'] = "Saint Helena, Ascension, and Tristan da Cunha"
countries.loc[0,'country_common_name'] = "Saint Helena, Ascension, and Tristan da Cunha"
countries.loc[25,'country_official_name'] = "Bonaire, Sint Eustatius, and Saba"

#### Test

In [122]:
countries.query( '( country_common_name == "BES Islands" ) | ( country_common_name == "Saint Helena, Ascension, and Tristan da Cunha")' )

,country_common_name,country_official_name,capital,territory_of,un_m49,iso_alpha3,least_developed_countries,landlocked_developing_countries,small_island_developing_states,un_region,developed,developing
0,"Saint Helena, Ascension, and Tristan da Cunha","Saint Helena, Ascension, and Tristan da Cunha",Jamestown,United Kingdom,654,SHN,False,False,False,11,False,True
25,BES Islands,"Bonaire, Sint Eustatius, and Saba",Kralendijk,Netherlands,535,BES,False,False,True,29,False,True

### 2) Change Text Input in `territory_of` to Index value
Ex: where `territory_of` is 'United Kingdom', change to 194.

#### Code

#### Test

### 3) Fill NaN in `territory_of`with 0

Fill NaN values in `territory_of` with 0. Set datatype of `territory_of` to int.

#### Code

#### Test

### 4) Drop 5 UN grouping columns
Drop `least_developed_countries`, `landlocked_developing_countries`, `small_island_developing_states`, `developed`, and `developing`. These columns are no longer needed. This information is now contained in the `un_groupings` and `country_to_group` dataframes.

#### Code

In [57]:
countries.drop( columns=['least_developed_countries','landlocked_developing_countries','small_island_developing_states','developed','developing'], axis=1, inplace=True )

#### Test

In [58]:
countries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 249 entries, 0 to 248
Data columns (total 7 columns):
country_common_name      249 non-null object
country_official_name    249 non-null object
capital                  243 non-null object
territory_of             51 non-null object
un_m49                   249 non-null int64
iso_alpha3               249 non-null object
un_region                249 non-null int64
dtypes: int64(2), object(5)
memory usage: 13.7+ KB

In [61]:
countries.query( 'territory_of == "United Kingdom"' )

,country_common_name,country_official_name,capital,territory_of,un_m49,iso_alpha3,un_region
10,British Indian Ocean Territory,British Indian Ocean Territory,Camp Justice,United Kingdom,86,IOT,14
59,Saint Helena,Saint Helena,Jamestown,United Kingdom,654,SHN,11
63,Anguilla,Anguilla,The Valley,United Kingdom,660,AIA,29
68,British Virgin Islands,British Virgin Islands,Road Town,United Kingdom,92,VGB,29
69,Cayman Islands,Cayman Islands,George Town,United Kingdom,136,CYM,29
79,Montserrat,Montserrat,Plymouth,United Kingdom,500,MSR,29
105,Falkland Islands,Falkland Islands,Stanley,United Kingdom,238,FLK,5
110,South Georgia and the South Sandwich Islands,South Georgia and the South Sandwich Islands,King Edward Point,United Kingdom,239,SGS,5
114,Bermuda,Bermuda,Hamilton,United Kingdom,60,BMU,21
179,Guernsey,Guernsey,St Peter Port,United Kingdom,831,GGY,830
180,Jersey,Bailiwick of Jersey,Saint Helier,United Kingdom,832,JEY,830
181,Sark,Sark,NaN,United Kingdom,680,NA,830
188,Isle of Man,Isle of Man,Douglas,United Kingdom,833,IMN,154
199,Gibraltar,Gibraltar,Gibraltar,United Kingdom,292,GIB,39
243,Pitcairn,"Pitcairn, Henderson, Ducie and Oeno Islands",Adamstown,United Kingdom,612,PCN,61

In [60]:
countries[ countries['country_common_name'] == 'United Kingdom' ]

,country_common_name,country_official_name,capital,territory_of,un_m49,iso_alpha3,un_region
194,United Kingdom,United Kingdom of Great Britain and Northern I...,London,NaN,826,GBR,154